# Essential tools
brew 'ack'
brew 'binutils'
brew 'coreutils'
brew 'git'
brew 'libevent'
brew 'libyaml'
brew 'multitail'
brew 'openssl'
brew 'readline'
brew 'sqlite'
brew 'tmux'
brew 'nvim'
brew 'watch'
brew 'postgresql'

# Python
brew 'python'
brew 'python3'

# Jvm
brew 'maven'
brew 'zinc'

# Elixir
brew 'elixir'

# Go
brew 'go'

# Postgres

# Platform
brew 'openshift-cli'
cask 'google-cloud-sdk'

# Casks
cask 'atom'
cask 'alfred'
cask 'dropbox'
cask 'docker'
cask 'flux'
cask 'karabiner-elements'
cask 'intellij-idea-ce'
cask 'iterm2'
cask 'spotify'
cask 'yourkit-java-profiler'
cask 'discord'
cask 'vlc'

# Kubernetes
brew 'kubectl'
cask 'minikube'

# App store
mas '1Password', id: 443987910
mas 'Slack', id: 803453959
